Repository: ditjonberisha/SignatureCheck
Catalog: SignatureCheck/App_GlobalResources/db.lang.*.resx
Languages: sq_al

# btnContact
source: Send
sq_al: Dergo

# btnReportdownload
source: Download report
sq_al: Shkarko raportin

# btnTest
source: Download
sq_al: Shkarko

# btnVerify
source: Start verification
sq_al: Verifiko

# btnVerifyanother
source: Verify further documents
sq_al: Verifiko dokument tjeter

# docReport
source: Document
sq_al: Dokumenti

# emailContact
source: E-mail*
sq_al: E-mail adresa*

# enkriptalg
source: Encryption Algorithm
sq_al: Algoritmi i Enkriptimit

# filenameReport
source: Name of signed file
sq_al: Emri i dokumentit

# FirstnameContact
source: First Name*
sq_al: Emri*

# firstnameReport
source: First Name
sq_al: Emri

# hashalg
source: Hash Algorithm
sq_al: Algoritmi i Hashit

# HashReport
source: Hash value of signed data (SHA256)
sq_al: Vlera hash e dokumentit (SHA256)

# header
source: SIGNATURE CHECK
sq_al: VERIFIKIMI I NËNSHKRIMIT DIGJITAL

# headerTest
source: Test Data
sq_al: Test Dokumenti

# infoContact
source: Below you can contact us for every question, suggestion or concern. Please make sure to fill out all the fields marked with *.
sq_al: Me posht mundeni te na kontaktoni per qdo pytje, sygjerim apo shqetesim tuajin. Ju lutemi sigurohuni qe te plotesoni te gjitha fushat te shenuara me *.

# infoReport
source: Signature check
sq_al: Nenshkrimi digjital

# infoTest
source: For testing our service, if you have not digitally signed document, below you can download a document that you can use as a test. After you download the file you can go to the page for verification and check the downloaded document.
sq_al: Per testimin e sherbimit tone, nese nuk keni dokument te nenshkruar ne menyr digjitale, me posht mundeni te shkarkoni nje dokument qe mund ta perdorni si testim. Pasi ta shkarkoni dokumentin ju mundeni te ktheheni te faqja per verifikim dhe ta beni verifikimin e dokumentit te shkarkuar.

# issuerc
source: Country(C)
sq_al: Shteti(C)

# issuercn
source: Name(CN)
sq_al: Emri(CN)

# issuerinfo
source: Info of certificate issuer
sq_al: Te dhenat e leshuesit te qerifikates

# issuero
source: Organization(O)
sq_al: Organizata(O)

# issuerou
source: Organizational unit(OU)
sq_al: Njesia organizative(OU)

# LastnameContact
source: Last Name*
sq_al: Mbiemri*

# lastnameReport
source: Last Name
sq_al: Mbiemri

# mnuContact
source: Contact
sq_al: Kontakti

# mnuInstruction
source: Instruction
sq_al: Instruksionet

# mnuTest
source: Test Data
sq_al: Test Dokument

# mnuVerify
source: Verify
sq_al: Verifikimi

# msgContact
source: Message*
sq_al: Mesazhi*

# Note
source: Note: Based on the Law on Information Society Services, Article 1 - Defines electronic documentation identical to Its traditional Legally counterpart in paper format.
sq_al: Shenim: Bazuar ne Ligjin Per Sherbimet e Shoqerise Informatike, Neni 1 - Përcakton dokumentacionin në formë elektronike juridikisht të barabartë me dokumentacionin tradicional të paraqitur në format të letrës.

# Report
source: Verification Report
sq_al: Raporti i verifikimit

# serialnumber
source: Certificate serial number
sq_al: Numri serik i certifikates

# signerInfo
source: Certificate information
sq_al: Te dhenat e nenshkruesit

# signerReport
source: Signer
sq_al: Nenshkruesi

source: Signing time
sq_al: Data e nenshkrimit

# sizeReport
source: Size of signed file
sq_al: Madhesia e dokumentit

# subjectContact
source: Subject
sq_al: Titulli

# testDoc
source: Digitally signed test document(signed_document.pdf)
sq_al: Test dokumenti i nenshkruar ne menyre digjitale(dokumenti_i_nenshkruar.pdf)

# TimeReport
source: Verification date and time
sq_al: Koha e verifikimit

# uploadDoc
source: Document:
sq_al: Dokumenti:

# uploadHeader
source: Verify the digital signature of the document
sq_al: Verifiko nënshkrimin digjital të dokumentit

# validfrom
source: Certificate valid from
sq_al: Certifikata valide prej

# validto
source: Certificate valid to
sq_al: Certifikata valide deri

# welcomeParagraph
source: Web site for verification of digital signature, allows you to verify the digital signature of PDF documents for authenticity in only a few seconds. As a result you will have a report with the data of signatories, which report can be downloaded.
sq_al: Web site per verfikimi i nenshkrimit digjital, ju mundeson verifikimin e nenshkrimit digjital te dokumenteve PDF per autenticitetin e tyre ne vetem disa sekonda. Si rezultat ju do te keni nje raport me te dhenat e nenshkruesit, te cilin raport mund edhe ta shkarkoni.

# InstrcDisplayingRes
source: Displaying verification reports:
sq_al: Paraqitja e raportit të verifikimit:

# InstrcHowToUse
source: How to use Signature Check:
sq_al: Si ta përdorni Verifikimin e nënshkrimit digjital:

# InstrcProcessingSig
source: Processing the signature verification:
sq_al: Si përdoret:

# InstrcReceivingTitle
source: Receiving signed documents & data:
sq_al: Pranimi i dokumenteve ose të dhënave të nënshkruara:

# InstrcReceivingText
source: When you receive the digitally signed documents or files, first save the signed document at a location you will easy remember later.
sq_al: Kur të pranoni dokumente ose file të nenshkruar në mënyrë digjitale, se pari ruani dokumentin e nënshkruar në një lokacion ku e mbani mend lehtë për t'i qasur më vonë.

# InstrcDisplayingResText
source: After completion the verification process will be presented the following report. This report shows if verification resulted valid and contains data for the signatory of the document and the issuer of the certificate. At the end of this report you have the "Download report" if you want to download this report (in PDF format), also you have the button " Verify further documents " if you want to check another document.
sq_al: Pas përfundimit të procesit të verifikimit do të paraqitet raporti si më poshtë. Ky raport tregon se a ka rezultuar i vlefshëm verifikimi si dhe përmban të dhënat për nënshkruesin e dokumenti dhe lëshuesin e certifikatës. Në fund të këtij raporti keni butonin “Shkarko raportin” nëse dëshironi ta shkarkoni këtë raport (në formatin PDF), gjithashtu keni edhe butonin “Verifiko dokument tjeter” nese dëshironi të verifikoni dokument tjetër.

# InstrcProcessingSigText
source: After opening the website or by clicking the “Verify” menu, opens the following site, which serves for upload signed document. Click on the “Choose file” and then select the document you want to upload, applies only to PDF signed documents. After selecting the document, click on the "Start verification" button. The process for verifying the signed document is initiated.
sq_al: Pasi të hapet ueb faqja ose duke klikuar në menyn "Verifikimi" hapet faqja si më poshtë, që shërben për ngarkimin e dokumentit të nënshkruar. Klikoni në pjesën "Choose file" dhe më pas zgjedhni dokumentin që dëshironi të ngarkoni, vlen vetëm për PDF dokumente që janë të nënshkruara. Pas zgjedhjes së dokumentit klikoni në butonin “Verifiko”. Procesi për verifikimin e dokumentit të nënshkruar është inicuar.

# InstrcImage1
source: img/page_en.png
sq_al: img/page_sq.png

# InstrcImage2
source: img/report_en.png
sq_al: img/report_sq.png
